Revit 2026 API

# Domain Enumeration

---

Type of connector domain.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum Domain
```
```vb
Public Enumeration Domain
```
```cpp
public enum class Domain
```
```fsharp
type Domain
```

| Member name | Value | Description |
| --- | --- | --- |
| DomainCableTrayConduit | 4 | Connector of cable trays or conduits |
| DomainElectrical | 2 | Electrical connector |
| DomainHvac | 1 | HVAC (duct) connector |
| DomainPiping | 3 | Piping connector |
| DomainStructuralAnalytical | 5 | Connector of Structural Analytical Model |
| DomainUndefined | 0 | Domain is undefined |

#### Reference

Autodesk.Revit.DB Namespace